lkolbly/cmsis-svd/data/Atmel/ATSAM4CMP8C_0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SUPC</name>
      <version>11249B</version>
      <description>Supply Controller</description>
      <groupName>SYSC</groupName>
      <prependToName>SUPC_</prependToName>
      <baseAddress>0x400E1410</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Supply Controller Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VROFF</name>
              <description>Voltage Regulator Off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_VREG</name>
                  <description>If KEY is correct, asserts the system reset signal and stops the voltage regulator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALSEL</name>
              <description>Crystal Oscillator Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYSTAL_SEL</name>
                  <description>If KEY is correct, switches the slow clock on the crystal oscillator output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR</name>
          <description>Supply Controller Supply Monitor Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMTH</name>
              <description>Supply Monitor Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSMPL</name>
              <description>Supply Monitor Sampling Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMD</name>
                  <description>Supply Monitor disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSM</name>
                  <description>Continuous Supply Monitor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 256 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 2,048 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMRSTEN</name>
              <description>Supply Monitor Reset Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The system reset signal is not affected when a supply monitor detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The system reset signal is asserted when a supply monitor detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIEN</name>
              <description>Supply Monitor Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The SUPC interrupt signal is not affected when a supply monitor detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SUPC interrupt signal is asserted when a supply monitor detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Supply Controller Mode Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000A00</resetValue>
          <fields>
            <field>
              <name>LCDVROUT</name>
              <description>LCD Voltage Regulator Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMODE</name>
              <description>LCD Controller Mode of Operation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDOFF</name>
                  <description>The internal supply source and the external supply source are both deselected (OFF mode).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDON_EXTVR</name>
                  <description>The external supply source for LCD (VDDLCD) is selected (the LCD voltage regulator is in Hi-Z mode).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDON_INVR</name>
                  <description>The internal supply source for LCD (the LCD Voltage Regulator) is selected (Active mode).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODRSTEN</name>
              <description>Brownout Detector Reset Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The system reset signal is not affected when a brownout detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The system reset signal is asserted when a brownout detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODDIS</name>
              <description>Brownout Detector Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The core brownout detector is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The core brownout detector is disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONREG</name>
              <description>Voltage Regulator enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONREG_UNUSED</name>
                  <description>Internal voltage regulator is not used (external power supply is used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONREG_USED</name>
                  <description>Internal voltage regulator is used.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUPPOREN</name>
              <description>Backup Area Power-On Reset Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUPPOR_DISABLE</name>
                  <description>Disables the backup POR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUPPOR_ENABLE</name>
                  <description>Enables the backup POR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSCBYPASS</name>
              <description>Oscillator Bypass</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect. Clock selection depends on XTALSEL value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>The 32 kHz crystal oscillator is bypassed if XTALSEL = 1. OSCBYPASS must be set before setting XTALSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Password Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
